//useEffect হলো react এর আরেকটা Hook Function
// useEffect দিয়ে মূলত সাইড এফেক্টের কাজ করা হয়। 

import { useEffect } from "react";

// যেমনঃ যদি কোনো কম্পোনেন্টের ভেতরে থাকা কোনো বাটনে ক্লিক করলে সেই কম্পোনেটের ভিতরের কোনো কিছু পরিবর্তন হয়না, এবং বাহিরের কোন API কে কল করে সেই API থেকে ডাটা নিয়ে আসা হলো, এই API থেকে আনা ডাটা কিন্ত কম্পোনেন্টের বাইরের জিনিস। এই কম্পোনেটের বাহিরের জিনিস নিয়ে কাজ করার জন্য useEffect ব্যবহার হয়। 

// মোটকথা কোনো কম্পোনেন্টের বাইরের জিনিস নিয়ে কাজ করতে হলে useEffect ব্যবহার করতে হয়।

// useEffect এর syntax: ................................
useEffect(fn, []) //এখানে () এর ভেতরে fn এর পরে ৩টা জিনিসের যেকোনো ১টা দেওয়া যায় ইউজ কেইস অনুযায়ী, ১- কিছুই না দিয়ে খালি রাখা যায়, ২- empty array [] দেওয়া যায়, ৩-[] এর ভেতরে বিভিন্ন ভ্যালু দেওয়া যায়, অ্যারের ভেতর যা দেওয়া হবে তা হলো useEffect এর প্যারেন্থিসিসে থাকা fn ফাংশনের dependency অর্থাৎ এই অ্যারের এলিমেন্ট গুলোর উপর useEffect এর প্যারেন্থিসিসে থাকা fn ফাংশনটা নির্ভরশীল থাকবে। 

//অর্থাৎঃ
useEffect(fn)
useEffect(fn, [])
useEffect(fn, [a,b]) //[]অ্যারের ভেতর যা দেওয়া হবে তা হলো useEffect এর প্যারেন্থিসিসে থাকা fn ফাংশনের dependency অর্থাৎ এই অ্যারের এলিমেন্ট গুলোর উপর fn ফাংশনটা নির্ভরশীল থাকবে। 

//এই তিনভাবে useEffect ফাংশন লেখা যায়। 