//.find() এবং .filter() মেথড কিছুটা একই রকম কাজ করে তবে সামান্য পার্থ্যক্য রয়েছে, যেমনঃ
// ১- ফিল্টার মেথডে অ্যারের যে এলিমেন্ট গুলো filter() মেথডের কন্ডিশন ফুলফিল করে সেই সকল এলিমেন্ট গুল নিয়ে সে একটা আলাদা অ্যারে গঠন করে

// কিন্ত .find() মেথডে অ্যারের যে এলিমেন্ট গুলো find() মেথডের কন্ডিশন ফুলফিল করে তারমধ্যে শুধু প্রথম এলিমেন্টটাকেই সে রিটার্ন করে, কিন্ত অ্যারে আকারে রিটার্ন করেনা, শুধু এলিমেন্টকেই রিটার্ন করবে, যেমন [10,20,30,40] এই অ্যারের প্রথম ৩টা এলিমেন্ট ১০,২০,৩০ যদি কন্ডিশন ফুলফিল করে তাহলে সে শুধু ১০ কেই রিটার্ন করবে, কিন্ত [10] এভাবে অ্যারে আকারে রিটার্ন করবে না, শুধু 10 রিটার্ন করবে।
 

//Example
{
    const smartphones = [
        { phoneName: "Iphone 15 pro",
          price: 82000,
          year: 2024,
          id: 1
        },
        { phoneName: "Samsung Galaxy S24",
          price: 160000,
          year: 2024,
          id: 2
        },
        { phoneName: "Redmi Note 13 Pro",
          price: 140000,
          year: 2024,
          id: 3
        },
        { phoneName: "Realme GT Neo 5",
          price: 90000,
          year: 2024,
          id: 4
        },
    ]; 

    smartphones.find(higherPrice);
    function higherPrice (value, index, array){
        return value.price > 130000; //এখানে অ্যারে অফ অবজেক্টের মধ্যে সেসব অবজেক্টের ফোনের দাম ১৩০০০০ এর বেশি তাদের মধ্যে সর্বপ্রথমটাকে রিটার্ন করবে, value হলো অ্যারের ভেতর থাকা একেকটা অবজেক্ট, আর সেই অবজেক্টের price প্রপার্টিকে এক্সেস করার জন্য লিখলাম value.price
    }

    const result = smartphones.find(higherPrice);
    console.log(result);
}